XMLSerializable/bin/Debug/myFileName.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:sig="http://signing2.zp.epuap.gov.pl" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header />
  <soapenv:Body>
    <sig:requestBody>
      <userTgsid>id</userTgsid>
    </sig:requestBody>
  </soapenv:Body>
</soapenv:Envelope>